FV2304/E_0502.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.3.1: AD: Lieferende von NB an LF</FONT></B><BR/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0502</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> LF</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde bereits zum identischen Abmeldedatum für die in diesem Geschäftsvorfall<BR align="left"/>genannte Marktlokation die Lieferende-Meldung positiv bestätigt?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lieferende zum Abmeldedatum wurde bereits bestätigt<BR align="left"/></FONT>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Liegt der Transaktionsgrund Stilllegung vor?<BR align="left"/>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Ist die Prognosegrundlage der Marktlokation auf Basis von Werten?<BR align="left"/>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Liegt das Lieferende-Datum mindestens einen 1 WT nach dem Nachrichteneingang?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Eine Stilllegung einer Marktlokation mit Prognosegrundlage auf Basis von Werten<BR align="left"/>kann nicht in die Vergangenheit gemeldet werden.<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Ist das Datum „Bilanzierungsende“ identisch mit dem Datum „Lieferende“?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Bei Marktlokation mit Prognosegrundlage auf Basis von Werten muss<BR align="left"/>Bilanzierungsende und Lieferende identisch sein.<BR align="left"/></FONT>>];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>60: </B>Wird ein Datum „Bilanzierungsende“ in der Abmeldung mitgeteilt?<BR align="left"/>>];
    "70" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>70: </B>Hat eine Bilanzierung stattgefunden?<BR align="left"/>>];
    "A13" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A13</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es wurde kein Bilanzierungsende mitgeteilt, obwohl eine Bilanzierung<BR align="left"/>stattgefunden hat.<BR align="left"/></FONT>>];
    "80" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>80: </B>Hat eine Bilanzierung stattgefunden?<BR align="left"/>>];
    "A18" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A18</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es wurde ein Bilanzierungsende mitgeteilt, obwohl keine Bilanzierung<BR align="left"/>stattgefunden hat<BR align="left"/></FONT>>];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>90: </B>Wurde bereits ein Lieferende zu einem späteren Termin durchgeführt?<BR align="left"/>>];
    "100" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>100: </B>Ist das mitgeteilte Bilanzierungsende später als das zuvor mitgeteilte<BR align="left"/>Bilanzierungsende?<BR align="left"/>>];
    "A14" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A14</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Bilanzierungsende ist später als das zuvor mitgeteilte Bilanzierungsende.<BR align="left"/></FONT>>];
    "110" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>110: </B>Ist das mitgeteilte Bilanzierungsende identisch zu dem zuvor mitgeteilten<BR align="left"/>Bilanzierungsende?<BR align="left"/>>];
    "120" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>120: </B>Ist die Anfrage nach dem 3. WT vor dem Monatsletzten eingegangen?<BR align="left"/>>];
    "130" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>130: </B>Ist das Bilanzierungsende ≤ dem Ende des Folgemonats (erster Tag des<BR align="left"/>übernächsten Monats 00:00 Uhr)?<BR align="left"/>>];
    "A20" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A20</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das Bilanzierungsende liegt zu weit in der Zukunft. Das bisherige<BR align="left"/>Bilanzierungsende muss angepasst werden.<BR align="left"/></FONT>>];
    "140" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>140: </B>Ist das Bilanzierungsende ≤ dem Ende des aktuellen Monats (erster Tag des<BR align="left"/>Folgemonats 00:00 Uhr)?<BR align="left"/>>];
    "A21" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A21</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Bilanzierungsfrist bei Marktlokationen mit Prognosegrundlage auf Basis von<BR align="left"/>Profilen nicht eingehalten.<BR align="left"/></FONT>>];
    "150" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>150: </B>Ist das Lieferendedatum ≤ dem Monatsersten des Folgemonats 00:00 Uhr, in<BR align="left"/>welchem der Geschäftsvorfall eingegangen ist?<BR align="left"/>>];
    "160" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>160: </B>Ist die Anfrage nach dem 3. WT vor dem Monatsletzten eingegangen?<BR align="left"/>>];
    "170" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>170: </B>Ist als Bilanzierungsende das Ende des Folgemonats (erster Tag des übernächsten<BR align="left"/>Monats 00:00 Uhr) angegeben?<BR align="left"/>>];
    "A15" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A15</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das Bilanzierungsende ist zum angegebenen Termin nicht mehr möglich<BR align="left"/></FONT>>];
    "180" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>180: </B>Ist als Bilanzierungsende das Ende des aktuellen Monats (erster Tag des<BR align="left"/>Folgemonats 00:00 Uhr) angegeben?<BR align="left"/>>];
    "A16" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A16</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das Bilanzierungsende ist nicht der erste Tag des Folgemonats 00:00 Uhr<BR align="left"/></FONT>>];
    "190" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>190: </B>Ist als Bilanzierungsende das Ende des Monats angeben, in welchem das<BR align="left"/>Lieferende liegt? (erster Tag des Folgemonats 00:00 Uhr des Monats in welchem<BR align="left"/>das Lieferende liegt).<BR align="left"/>>];
    "A17" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A17</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das Bilanzierungsende bei Lieferenden, welche in einem zukünftigen Monat<BR align="left"/>liegen, muss zum Ablauf des gleichen Monats sein.<BR align="left"/></FONT>>];
    "200" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>200: </B>Liegen dem LF Informationen darüber vor, dass die Marktlokation nicht<BR align="left"/>stillgelegt wird/wurde?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Dem LF liegen Informationen vor, dass die Marktlokation nicht stillgelegt wird/wurde.<BR align="left"/>Hinweis: Die Informationen sind in der Antwort zu beschreiben/benennen.<BR align="left"/></FONT>>];
    "210" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>210: </B>Ist das Datum „Bilanzierungsende“ identisch mit dem Datum „Lieferende“?<BR align="left"/>>];
    "A11" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A11</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lieferende und Bilanzierungsende müssen bei Lieferende von NB an LF aufgrund<BR align="left"/>entfallender Zuordnungsermächtigung synchron sein.<BR align="left"/></FONT>>];
    "220" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>220: </B>Liegt das übermittelte Datum „Lieferende“ nach dem Nachrichteneingang?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lieferende bei entfallender Zuordnungsermächtigung muss in der Zukunft liegen.<BR align="left"/></FONT>>];
    "230" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>230: </B>Ist das angegebene Datum „Lieferende“ der nächste 1. eines Kalendermonats 00:00 Uhr?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das Lieferende bei Abmeldung wegen Deaktivierung der Zuordnungsermächtigung<BR align="left"/>muss auf dem 1. eines Kalendermonats liegen.<BR align="left"/></FONT>>];
    "240" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>240: </B>Liegt der Transaktionsgrund Abmeldung wegen fehl. Zuordnungsermächtigung<BR align="left"/>aufgrund Änderung ZRT vor?<BR align="left"/>>];
    "250" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>250: </B>Wurde der Zeitreihentyp an der betreffenden Marktlokation in einen<BR align="left"/>Zeitreihentyp geändert, für welchen keine Zuordnungsermächtigung besteht?<BR align="left"/>>];
    "A12" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A12</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es liegt keine Änderung des Zeitreihentyps vor, für welchen keine<BR align="left"/>Zuordnungsermächtigung besteht.<BR align="left"/></FONT>>];
    "260" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>260: </B>Hat der BKV die Deaktivierung der Zuordnungsermächtigung für den ZRT, welcher<BR align="left"/>der genannten Marktlokation zugeordnet ist, vorgenommen?<BR align="left"/>>];
    "A09" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A09</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Deaktivierung der Zuordnungsermächtigung für den der Marktlokation zugeordneten<BR align="left"/>ZRT hat nicht stattgefunden.<BR align="left"/></FONT>>];
    "270" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>270: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A10" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A10</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Lieferende wird zugestimmt<BR align="left"/></FONT>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "A01" [label="Ja"];
    "10" -> "20" [label="Nein"];
    "20" -> "30" [label="Ja"];
    "20" -> "210" [label="Nein"];
    "30" -> "40" [label="Ja"];
    "30" -> "60" [label="Nein"];
    "40" -> "A02" [label="Nein"];
    "40" -> "50" [label="Ja"];
    "50" -> "A03" [label="Nein"];
    "50" -> "200" [label="Ja"];
    "60" -> "80" [label="Ja"];
    "60" -> "70" [label="Nein"];
    "70" -> "A13" [label="Ja"];
    "70" -> "200" [label="Nein"];
    "80" -> "A18" [label="Nein"];
    "80" -> "90" [label="Ja"];
    "90" -> "100" [label="Ja"];
    "90" -> "120" [label="Nein"];
    "100" -> "A14" [label="Ja"];
    "100" -> "110" [label="Nein"];
    "110" -> "120" [label="Ja"];
    "110" -> "150" [label="Nein"];
    "120" -> "130" [label="Ja"];
    "120" -> "140" [label="Nein"];
    "130" -> "A20" [label="Nein"];
    "130" -> "200" [label="Ja"];
    "140" -> "A21" [label="Nein"];
    "140" -> "200" [label="Ja"];
    "150" -> "160" [label="Ja"];
    "150" -> "190" [label="Nein"];
    "160" -> "170" [label="Ja"];
    "160" -> "180" [label="Nein"];
    "170" -> "A15" [label="Nein"];
    "170" -> "200" [label="Ja"];
    "180" -> "A16" [label="Nein"];
    "180" -> "200" [label="Ja"];
    "190" -> "A17" [label="Nein"];
    "190" -> "200" [label="Ja"];
    "200" -> "A06" [label="Ja"];
    "200" -> "270" [label="Nein"];
    "210" -> "A11" [label="Nein"];
    "210" -> "220" [label="Ja"];
    "220" -> "A07" [label="Nein"];
    "220" -> "230" [label="Ja"];
    "230" -> "A08" [label="Nein"];
    "230" -> "240" [label="Ja"];
    "240" -> "250" [label="Ja"];
    "240" -> "260" [label="Nein"];
    "250" -> "A12" [label="Nein"];
    "250" -> "260" [label="Ja"];
    "260" -> "A09" [label="Nein"];
    "260" -> "270" [label="Ja"];
    "270" -> "A10" [label="Nein"];
    "270" -> "A99" [label="Ja"];

    bgcolor="transparent";
}
