FV2304/E_0502.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.3.1: AD: Lieferende von NB an LF



end title
:<b>E_0502</b>;
note right
<b><i>Prüfende Rolle: LF
end note

if (<b>1: </b> Wurde bereits zum identischen Abmeldedatum für die in diesem Geschäftsvorfall genannte Marktlokation die Lieferende-Meldung positiv bestätigt?) then (ja)
    :A01;
    note left
        Cluster: Ablehnung
        Lieferende zum Abmeldedatum wurde bereits bestätigt
    endnote
    kill;
else (nein)
endif
if (<b>2: </b> Liegt der Transaktionsgrund Stilllegung vor?) then (ja)
    if (<b>3: </b> Ist die Prognosegrundlage der Marktlokation auf Basis von Werten?) then (ja)
        if (<b>4: </b> Liegt das Lieferende-Datum mindestens einen 1 WT nach dem Nachrichteneingang?) then (ja)
        else (nein)
            :A02;
            note left
                Cluster: Ablehnung
                Eine Stilllegung einer Marktlokation mit Prognosegrundlage auf Basis von Werten kann nicht in die Vergangenheit gemeldet werden.
            endnote
            kill;
        endif
        if (<b>5: </b> Ist das Datum „Bilanzierungsende“ identisch mit dem Datum „Lieferende“?) then (ja)
        else (nein)
            :A03;
            note left
                Cluster: Ablehnung
                Bei Marktlokation mit Prognosegrundlage auf Basis von Werten muss Bilanzierungsende und Lieferende identisch sein.
            endnote
            kill;
        endif
        if (<b>8: </b> Liegen dem LF Informationen darüber vor, dass die Marktlokation nicht stillgelegt wird/wurde?) then (ja)
            :A06;
            note left
                Cluster: Ablehnung
                Dem LF liegen Informationen vor, dass die Marktlokation nicht stillgelegt wird/wurde.
                Hinweis: Die Informationen sind in der Antwort zu beschreiben/benennen.
            endnote
            kill;
        else (nein)
        endif
        if (<b>15: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Cluster: Ablehnung Sonstiges 
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :A10;
            note left
                Cluster: Zustimmung
                Lieferende wird zugestimmt
            endnote
            kill;
        endif
    else (nein)
        if (<b>6: </b> Liegt das Datum „Bilanzierungsende“ mindestens 3 WT nach dem Nachrichteneingang?) then (ja)
        else (nein)
            :A04;
            note left
                Cluster: Ablehnung
                Bilanzierungsfrist bei Marktlokationen mit Prognosegrundlage auf Basis von Profilen nicht eingehalten.
            endnote
            kill;
        endif
        if (<b>7: </b> Liegt das Datum „Bilanzierungsende“ auf dem 1. eines Kalendermonates 0:00 Uhr?) then (ja)
        else (nein)
            :A05;
            note left
                Cluster: Ablehnung
                Bilanzierungsende liegt nicht auf dem Monatswechsel
            endnote
            kill;
        endif
        if (<b>8: </b> Liegen dem LF Informationen darüber vor, dass die Marktlokation nicht stillgelegt wird/wurde?) then (ja)
            :A06;
            note left
                Cluster: Ablehnung
                Dem LF liegen Informationen vor, dass die Marktlokation nicht stillgelegt wird/wurde.
                Hinweis: Die Informationen sind in der Antwort zu beschreiben/benennen.
            endnote
            kill;
        else (nein)
        endif
        if (<b>15: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Cluster: Ablehnung Sonstiges 
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :A10;
            note left
                Cluster: Zustimmung
                Lieferende wird zugestimmt
            endnote
            kill;
        endif
    endif
    if (<b>8: </b> Liegen dem LF Informationen darüber vor, dass die Marktlokation nicht stillgelegt wird/wurde?) then (ja)
        :A06;
        note left
            Cluster: Ablehnung
            Dem LF liegen Informationen vor, dass die Marktlokation nicht stillgelegt wird/wurde.
            Hinweis: Die Informationen sind in der Antwort zu beschreiben/benennen.
        endnote
        kill;
    else (nein)
    endif
    if (<b>15: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Cluster: Ablehnung Sonstiges 
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
        endnote
        kill;
    else (nein)
        :A10;
        note left
            Cluster: Zustimmung
            Lieferende wird zugestimmt
        endnote
        kill;
    endif
else (nein)
    if (<b>9: </b> Ist das Datum „Bilanzierungsende“ identisch mit dem Datum „Lieferende“?) then (ja)
    else (nein)
        :A11;
        note left
            Cluster: Ablehnung
            Lieferende und Bilanzierungsende müssen bei Lieferende von NB an LF aufgrund entfallender Zuordnungsermächtigung synchron sein
        endnote
        kill;
    endif
    if (<b>10: </b> Liegt das übermittelte Datum „Lieferende“ nach dem Nachrichteneingang?) then (ja)
    else (nein)
        :A07;
        note left
            Cluster: Ablehnung
            Lieferende bei entfallender Zuordnungsermächtigung muss in der Zukunft liegen.
        endnote
        kill;
    endif
    if (<b>11: </b> Ist das angegebene Datum „Lieferende“ der nächste 1. eines Kalendermonats 00:00 Uhr?) then (ja)
    else (nein)
        :A08;
        note left
            Cluster: Ablehnung
            Das Lieferende bei Abmeldung wegen Deaktivierung der Zuordnungsermächtigung muss auf dem 1. eines Kalendermonats liegen.
        endnote
        kill;
    endif
    if (<b>12: </b> Liegt der Transaktionsgrund Abmeldung wegen fehl. Zuordnungsermächtigung aufgrund Änderung ZRT vor?) then (ja)
        if (<b>13: </b> Wurde der Zeitreihentyp an der betreffenden Marktlokation in einen Zeitreihentyp geändert, für welchen keine Zuordnungsermächtigung besteht?) then (ja)
        else (nein)
            :A12;
            note left
                Cluster: Ablehnung
                Es liegt keine Änderung des Zeitreihentyps vor, für welchen keine Zuordnungsermächtigung besteht.
            endnote
            kill;
        endif
        if (<b>15: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Cluster: Ablehnung Sonstiges 
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :A10;
            note left
                Cluster: Zustimmung
                Lieferende wird zugestimmt
            endnote
            kill;
        endif
    else (nein)
        if (<b>14: </b> Hat der BKV die Deaktivierung der Zuordnungsermächtigung für den ZRT, welcher der genannten Marktlokation zugeordnet ist, vorgenommen?) then (ja)
        else (nein)
            :A09;
            note left
                Cluster: Ablehnung
                Deaktivierung der Zuordnungsermächtigung für den der Marktlokation zugeordneten ZRT hat nicht stattgefunden.
            endnote
            kill;
        endif
        if (<b>15: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Cluster: Ablehnung Sonstiges 
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :A10;
            note left
                Cluster: Zustimmung
                Lieferende wird zugestimmt
            endnote
            kill;
        endif
    endif
endif
if (<b>15: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Cluster: Ablehnung Sonstiges 
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
        Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
    endnote
    kill;
else (nein)
    :A10;
    note left
        Cluster: Zustimmung
        Lieferende wird zugestimmt
    endnote
    kill;
endif

@enduml
